oxlm/rt-thread/bsp/nxp/mcx/mcxn/frdm-mcxn947/applications/usb_adc_mic.c
/*
 * Copyright (c) 2006-2026, RT-Thread Development Team
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Change Logs:
 * Date           Author       Notes
 * 2026-09-05     RT-Thread    three-channel ADC USB microphone
 */

#include <rthw.h>
#include <rtthread.h>

#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include "board.h"
#include "fsl_clock.h"
#include "fsl_ctimer.h"
#include "fsl_edma.h"
#include "fsl_inputmux.h"
#include "fsl_inputmux_connections.h"
#include "fsl_lpadc.h"
#include "fsl_opamp.h"
#include "fsl_port.h"
#include "usbd_audio.h"
#include "usbd_core.h"

#if defined(RT_CHERRYUSB_DEVICE_TEMPLATE_NONE) && defined(RT_CHERRYUSB_DEVICE_AUDIO)

#define USBD_VID           0x2200
#define USBD_PID           0x0009
#define USBD_MAX_POWER     100
#define USBD_LANGID_STRING 1033

#ifdef CONFIG_USB_HS
/* HS isochronous: microframes = 2^(bInterval - 1), i.e. bInterval = log2(microframes) + 1.
 * 1 ms per packet is 8 microframes = 2^3, hence 0x04. */
#define EP_INTERVAL 0x04
#else
#define EP_INTERVAL 0x01
#endif

#define USB_ADC_MIC_SAMPLE_RATE      16000U
#define USB_ADC_MIC_CHANNELS         3U
#define USB_ADC_MIC_BYTES_PER_SAMPLE 2U
#define USB_ADC_MIC_BITS_PER_SAMPLE  16U
#define USB_ADC_MIC_SAMPLES_PER_MS   (USB_ADC_MIC_SAMPLE_RATE / 1000U)
#define USB_ADC_MIC_PACKET_BYTES     (USB_ADC_MIC_SAMPLES_PER_MS * USB_ADC_MIC_CHANNELS * USB_ADC_MIC_BYTES_PER_SAMPLE)
#define USB_ADC_MIC_AUDIO_SLOT_BYTES (USB_ADC_MIC_CHANNELS * USB_ADC_MIC_BYTES_PER_SAMPLE)
#define USB_ADC_MIC_EP_MAX_PACKET_BYTES (USB_ADC_MIC_PACKET_BYTES + USB_ADC_MIC_AUDIO_SLOT_BYTES)
#define USB_ADC_MIC_CTIMER_MATCH_RATE (USB_ADC_MIC_SAMPLE_RATE)
#define USB_ADC_MIC_TX_THREAD_STACK_SIZE 2048U
#define USB_ADC_MIC_TX_THREAD_PRIORITY   8U
#define USB_ADC_MIC_TX_THREAD_TICK       10U

#define USB_ADC_MIC_DMA_BLOCKS 8U
#define USB_ADC_MIC_PCM_BLOCKS 8U

#define AUDIO_IN_EP       0x81
#define AUDIO_IN_CLOCK_ID 0x01
#define AUDIO_IN_FU_ID    0x03

#define BMCONTROL       (AUDIO_V2_CONTROL_MUTE | AUDIO_V2_CONTROL_VOLUME)
#define INPUT_CTRL      DBVAL(BMCONTROL), DBVAL(BMCONTROL), DBVAL(BMCONTROL), DBVAL(BMCONTROL)
#define INPUT_CH_ENABLE 0x00000007

#define USB_ADC_MIC_ADC_CMD_ID     1U
#define USB_ADC_MIC_ADC_TRIGGER_ID 0U

#define USB_ADC_MIC_DMA_CHANNEL_ADC0_A 0U
#define USB_ADC_MIC_DMA_CHANNEL_ADC1_A 3U
#define USB_ADC_MIC_DMA_CHANNEL_ADC1_B 4U

#ifndef USB_ADC_MIC_USE_OPAMP
#define USB_ADC_MIC_USE_OPAMP 0
#endif

/* One-pole high-pass filter on the ADC path, feeding the backend directly. It
 * is the DC blocker here: with kLPADC_ReferenceVoltageAlt3 the LPADC spans
 * 0..VDD_ANA, so 0 V is the bottom of its range, and there is no VREF/2 bias
 * network on the input (USB_ADC_MIC_USE_OPAMP is 0), so the DC has to be
 * removed in software.
 *
 * The raw unsigned code goes in rather than a raw-32768 PCM value: the filter
 * only ever sees x[n]-x[n-1], so a constant offset cancels in the difference.
 *
 * Coefficient a = exp(-2*pi*fc/fs) = 0.9980384 for fc = 5 Hz, fs = 16 kHz; the
 * nearest Q15 grid point is 32704/32768, actual cutoff 5.01 Hz. Response is
 * -3 dB at 5 Hz, -1.0 dB at 10 Hz, -0.3 dB at 20 Hz and ~0 dB above, so voice
 * content (roughly 80 Hz and up) passes through uncut. A DC step settles after
 * about 5 tau = 160 ms (tau = 1/(2*pi*fc) = 31.8 ms). */
#define USB_ADC_MIC_HPF_ALPHA_Q15           32704U
#define USB_ADC_MIC_HPF_SCALE               32768U
#define USB_ADC_MIC_HPF_SHIFT               15U
#define USB_ADC_MIC_HPF_ROUND               (1U << 14)

/* LPADC channel numbers for ADC0_A2 + ADC1_A0 + ADC1_B0. */
#ifndef USB_ADC_MIC_ADC0_A_CHANNEL
#define USB_ADC_MIC_ADC0_A_CHANNEL 2U
#endif

#ifndef USB_ADC_MIC_ADC1_A_CHANNEL
#define USB_ADC_MIC_ADC1_A_CHANNEL 0U
#endif

#ifndef USB_ADC_MIC_ADC1_B_CHANNEL
#define USB_ADC_MIC_ADC1_B_CHANNEL 0U
#endif

#ifndef USB_ADC_MIC_OPAMP_GAIN
#define USB_ADC_MIC_OPAMP_GAIN kOPAMP_PosGainNonInvert1X
#endif

#define USB_CONFIG_SIZE (9 +                                                                  \
                         AUDIO_V2_AC_DESCRIPTOR_LEN +                                         \
                         AUDIO_V2_SIZEOF_AC_CLOCK_SOURCE_DESC +                               \
                         AUDIO_V2_SIZEOF_AC_INPUT_TERMINAL_DESC +                             \
                         AUDIO_V2_SIZEOF_AC_FEATURE_UNIT_DESC(USB_ADC_MIC_CHANNELS) +          \
                         AUDIO_V2_SIZEOF_AC_OUTPUT_TERMINAL_DESC +                            \
                         AUDIO_V2_AS_DESCRIPTOR_LEN)

#define AUDIO_AC_SIZ (AUDIO_V2_SIZEOF_AC_HEADER_DESC +                                      \
                      AUDIO_V2_SIZEOF_AC_CLOCK_SOURCE_DESC +                                \
                      AUDIO_V2_SIZEOF_AC_INPUT_TERMINAL_DESC +                              \
                      AUDIO_V2_SIZEOF_AC_FEATURE_UNIT_DESC(USB_ADC_MIC_CHANNELS) +           \
                      AUDIO_V2_SIZEOF_AC_OUTPUT_TERMINAL_DESC)

static const uint8_t device_descriptor[] =
{
    USB_DEVICE_DESCRIPTOR_INIT(USB_2_0, 0x00, 0x00, 0x00, USBD_VID, USBD_PID, 0x0001, 0x01)
};

static const uint8_t config_descriptor[] =
{
    USB_CONFIG_DESCRIPTOR_INIT(USB_CONFIG_SIZE, 0x02, 0x01, USB_CONFIG_BUS_POWERED, USBD_MAX_POWER),
    AUDIO_V2_AC_DESCRIPTOR_INIT(0x00, 0x02, AUDIO_AC_SIZ, AUDIO_CATEGORY_MICROPHONE, 0x00, 0x00),
    AUDIO_V2_AC_CLOCK_SOURCE_DESCRIPTOR_INIT(AUDIO_IN_CLOCK_ID, 0x01, 0x01),
    AUDIO_V2_AC_INPUT_TERMINAL_DESCRIPTOR_INIT(0x02, AUDIO_INTERM_MIC, AUDIO_IN_CLOCK_ID,
                                               USB_ADC_MIC_CHANNELS, INPUT_CH_ENABLE, 0x0000),
    AUDIO_V2_AC_FEATURE_UNIT_DESCRIPTOR_INIT(AUDIO_IN_FU_ID, 0x02, INPUT_CTRL),
    AUDIO_V2_AC_OUTPUT_TERMINAL_DESCRIPTOR_INIT(0x04, AUDIO_TERMINAL_STREAMING, AUDIO_IN_FU_ID,
                                                AUDIO_IN_CLOCK_ID, 0x0000),
    AUDIO_V2_AS_DESCRIPTOR_INIT(0x01, 0x04, USB_ADC_MIC_CHANNELS, INPUT_CH_ENABLE,
                                USB_ADC_MIC_BYTES_PER_SAMPLE, USB_ADC_MIC_BITS_PER_SAMPLE,
                                AUDIO_IN_EP, 0x05, USB_ADC_MIC_EP_MAX_PACKET_BYTES, EP_INTERVAL)
};

static const uint8_t device_quality_descriptor[] =
{
    0x0a,
    USB_DESCRIPTOR_TYPE_DEVICE_QUALIFIER,
    0x00,
    0x02,
    0x00,
    0x00,
    0x00,
    0x40,
    0x00,
    0x00,
};

