oxlm/rt-thread/bsp/nxp/mcx/mcxn/frdm-mcxn947/applications/usb_adc_mic.c
    memcpy(s_pcm_ring[s_pcm_write], data, USB_ADC_MIC_PACKET_BYTES);
    s_pcm_write = (uint8_t)((s_pcm_write + 1U) % USB_ADC_MIC_PCM_BLOCKS);
    s_pcm_count++;
    rt_hw_interrupt_enable(level);
}

static bool usb_adc_mic_ring_pop(uint8_t *data)
{
    bool has_data = false;
    rt_base_t level;

    level = rt_hw_interrupt_disable();
    if (s_pcm_count > 0U)
    {
        memcpy(data, s_pcm_ring[s_pcm_read], USB_ADC_MIC_PACKET_BYTES);
        s_pcm_read = (uint8_t)((s_pcm_read + 1U) % USB_ADC_MIC_PCM_BLOCKS);
        s_pcm_count--;
        has_data = true;
    }
    rt_hw_interrupt_enable(level);

    return has_data;
}

/* One-pole high-pass, direct form:
 *     y[n] = a * y[n-1] + (x[n] - x[n-1])
 * with H(z) = (1 - z^-1) / (1 - a * z^-1), so |H(pi)| = 2/(1+a) = 1.001.
 *
 * x is the raw unsigned LPADC code, 0..65535. Each product fits int32 on its
 * own (a * 32767 is 1.07e9, 32768 * 65535 is 2.15e9), but their sum can reach
 * 3.2e9 and would overflow int32, hence the int64 accumulate. + ROUND makes the
 * 15-bit shift round-half-up; the difference term is an exact multiple of 2^15,
 * so rounding the sum is the same as rounding only the feedback term.
 *
 * The clip is the only place int16 is applied: a DC step transients to 32767 and
 * decays from there, and |H(pi)| > 1 means a full-scale square wave peaks just
 * over 32767 and clips one count. The integer state stalls when |y| <= 256
 * counts, so a DC step settles at about 256 counts rather than exactly zero -
 * -42 dBFS, below anything the backend cares about. */
static int16_t usb_adc_mic_hpf(uint32_t raw, uint32_t ch)
{
    int64_t num;
    int32_t diff;
    int32_t out;

    diff = (int32_t)raw - s_hpf_prev_in[ch];
    s_hpf_prev_in[ch] = (int32_t)raw;

    num = (int64_t)USB_ADC_MIC_HPF_ALPHA_Q15 * s_hpf_prev_out[ch]
        + (int64_t)USB_ADC_MIC_HPF_SCALE * diff;
    out = (int32_t)((num + USB_ADC_MIC_HPF_ROUND) >> USB_ADC_MIC_HPF_SHIFT);
    if (out > 32767)
    {
        out = 32767;
    }
    else if (out < -32768)
    {
        out = -32768;
    }

    s_hpf_prev_out[ch] = out;
    return (int16_t)out;
}

static void usb_adc_mic_mix_block(uint32_t block)
{
    uint8_t pcm[USB_ADC_MIC_PACKET_BYTES];
    uint8_t *dst;

    dst = pcm;
    for (uint32_t i = 0U; i < USB_ADC_MIC_SAMPLES_PER_MS; i++)
    {
        for (uint32_t ch = 0U; ch < USB_ADC_MIC_CHANNELS; ch++)
        {
            const volatile uint32_t *src;
            int16_t sample;

            src = s_adc_sample_src[ch] + (block * USB_ADC_MIC_SAMPLES_PER_MS);
            sample = usb_adc_mic_hpf(src[i], ch);
            *dst++ = (uint8_t)(sample & 0xff);
            *dst++ = (uint8_t)(((uint16_t)sample >> 8) & 0xff);
        }
    }

    usb_adc_mic_ring_push(pcm);
}

static uint32_t usb_adc_mic_min_done_count(void)
{
    uint32_t min_done;

    min_done = s_dma_done_count[0];
    if (s_dma_done_count[1] < min_done)
    {
        min_done = s_dma_done_count[1];
    }
    if (s_dma_done_count[2] < min_done)
    {
        min_done = s_dma_done_count[2];
    }

    return min_done;
}

static void usb_adc_mic_dma_callback(edma_handle_t *handle, void *userData, bool transferDone, uint32_t tcds)
{
    uint32_t dma_index;
    uint32_t done_blocks;

    (void)handle;

    dma_index = (uint32_t)(uintptr_t)userData;
    if (dma_index >= USB_ADC_MIC_CHANNELS)
    {
        return;
    }
    if (!s_streaming)
    {
        return;
    }

    done_blocks = tcds;
    if (done_blocks == 0U)
    {
        if (!transferDone)
        {
            return;
        }
        done_blocks = 1U;
    }

    s_dma_done_count[dma_index] += done_blocks;
    while (s_mixed_count < usb_adc_mic_min_done_count())
    {
        uint32_t block;

        block = s_mixed_count % USB_ADC_MIC_DMA_BLOCKS;
        usb_adc_mic_mix_block(block);
        s_mixed_count++;
    }
}

static void usb_adc_mic_prepare_dma_ring(edma_handle_t *handle,
                                         edma_transfer_config_t *transfer,
                                         edma_tcd_t *tcd,
                                         uint32_t channel,
                                         int32_t request,
                                         const volatile uint32_t *fifo,
                                         volatile uint32_t raw[USB_ADC_MIC_DMA_BLOCKS][USB_ADC_MIC_SAMPLES_PER_MS],
                                         void *callback_user_data)
{
    EDMA_CreateHandle(handle, DMA0, channel);
    EDMA_InstallTCDMemory(handle, tcd, USB_ADC_MIC_DMA_BLOCKS);
    EDMA_SetChannelMux(DMA0, channel, request);
    EDMA_SetCallback(handle, usb_adc_mic_dma_callback, callback_user_data);

    for (uint32_t i = 0U; i < USB_ADC_MIC_DMA_BLOCKS; i++)
    {
        EDMA_PrepareTransfer(&transfer[i],
                             (void *)fifo,
                             sizeof(uint32_t),
                             (void *)&raw[i][0],
                             sizeof(uint32_t),
                             sizeof(uint32_t),
                             sizeof(raw[i]),
                             kEDMA_PeripheralToMemory);
    }
}

static bool usb_adc_mic_start_dma_ring(edma_handle_t *handle, edma_transfer_config_t *transfer)
{
    status_t status;

    EDMA_AbortTransfer(handle);
    status = EDMA_SubmitLoopTransfer(handle, transfer, USB_ADC_MIC_DMA_BLOCKS);
    if (status != kStatus_Success)
    {
        USB_LOG_ERR("ADC mic EDMA submit failed: %d\r\n", (int)status);
        return false;
    }

    EDMA_StartTransfer(handle);

    return true;
}

static void usb_adc_mic_init_opamp(OPAMP_Type *base)
{
    opamp_config_t config;

    OPAMP_GetDefaultConfig(&config);
    config.enable = true;
    config.mode = kOPAMP_LowNoiseMode;
    config.posGain = USB_ADC_MIC_OPAMP_GAIN;
    config.negGain = kOPAMP_NegGainBufferMode;
#if defined(FSL_FEATURE_OPAMP_HAS_OPAMP_CTR_OUTSW) && FSL_FEATURE_OPAMP_HAS_OPAMP_CTR_OUTSW
    config.enableOutputSwitch = true;
#endif
#if defined(FSL_FEATURE_OPAMP_HAS_OPAMP_CTR_ADCSW1) && FSL_FEATURE_OPAMP_HAS_OPAMP_CTR_ADCSW1
    config.enablePosADCSw1 = true;
#else
    config.enablePosADCSw = true;
#endif
#if defined(FSL_FEATURE_OPAMP_HAS_OPAMP_CTR_ADCSW2) && FSL_FEATURE_OPAMP_HAS_OPAMP_CTR_ADCSW2
    config.enablePosADCSw2 = true;
#endif
#if defined(FSL_FEATURE_OPAMP_HAS_OPAMP_CTR_BUFEN) && FSL_FEATURE_OPAMP_HAS_OPAMP_CTR_BUFEN
    config.enableRefBuffer = ((uint32_t)USB_ADC_MIC_OPAMP_GAIN <= 7U);
#endif
#if defined(FSL_FEATURE_OPAMP_HAS_OPAMP_CTR_INPSEL) && FSL_FEATURE_OPAMP_HAS_OPAMP_CTR_INPSEL
    config.PosInputChannelSelection = kOPAMP_PosInputChannel0;
#endif
#if defined(FSL_FEATURE_OPAMP_HAS_OPAMP_CTR_TRIGMD) && FSL_FEATURE_OPAMP_HAS_OPAMP_CTR_TRIGMD
    config.enableTriggerMode = false;
#endif

    OPAMP_Init(base, &config);
}

static void usb_adc_mic_config_adc_pins(void)
{
    const port_pin_config_t adc0_a2_config = {
        kPORT_PullDisable,
        kPORT_LowPullResistor,
        kPORT_FastSlewRate,
        kPORT_PassiveFilterDisable,
        kPORT_OpenDrainDisable,
        kPORT_LowDriveStrength,
        kPORT_MuxAlt0,
        kPORT_InputBufferDisable,
        kPORT_InputNormal,
        kPORT_UnlockRegister,
    };

